import 'package:photo_editor/model/filter.dart';

class Filters{

  List<Filter> list(){
    return <Filter>[
      Filter('Без фильтра', [
          1, 0, 0, 0, 0,
          0, 1, 0, 0, 0,
          0, 0, 1, 0, 0, 
          0, 0, 0, 1, 0
      ]
      ),
      Filter('Фиолетовый', [
          1, -0.2, 0, 0, 0,
          0, 1, 0, -0.1, 0,
          0, 1.2, 1, 0.1, 0, 
          0, 0, 1.7, 1, 0
      ]
      ),
      Filter('Желтый', [
          1, 0, 0, 0, 0,
          -0.2, 1, 0.3, 0.1, 0,
          -0.1, 0, 1, 0, 0, 
          0, 0, 0, 1, 0
      ]
      ),
      Filter('Красный', [
          1, 0, 0, 1.9, -2.2,
          0, 1, 0, 0, 0.3,
          0, 0, 1, 0, 0.5, 
          0, 0, 0, 1, 0.2
      ]
      ),
      Filter('Ч&Б', [
          0, 1, 0, 0, 0,
          0, 1, 0, 0, 0,
          0, 1, 0, 0, 0, 
          0, 1, 0, 1, 0
      ]
      ),
    ];
  }
}